# Урок 1. Ввод-Вывод, операторы ветвления
# Задача 2:
# Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |


# n = int(input('Введите трехзначное число: '))
#
# ed = n % 10
# prom = n // 10
# des = prom % 10
# sot = prom // 10
#
# print('Сумма цифр числа: ', sot + des + ed)

# Задача 4:
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
#
# *Пример:*
#
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

# n = int(input('Введите количество журавликов: '))
#
# s = int (n / 6)
# p = s
# k = (s + p) * 2
#
# print('Петя, Катя и Сережа сделали журавликов: ', p ,', ', k , ', ', s)

# Задача 6:
# Вы пользуетесь общественным транспортом? Вероятно,
# вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
#
# *Пример:*
#
# 385916 -> yes
# 123456 -> no

# n = input('Введите номер билета: ')
#
# a = int(n[0])
# b = int(n[1])
# c = int(n[2])
# d = int(n[3])
# e = int(n[4])
# f = int(n[5])
# s1 = a + b + c
# s2 = d + e + f
# if s1 == s2:
#     print('yes')
# else: print('no')

# Задача 8:
# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
#
# *Пример:*
#
# 3 2 4 -> yes
# 3 2 1 -> no

# n = int(input('Введите n: '))
# m = int(input('Введите m: '))
# k = int(input('Введите k: '))
# if k < n * m and ((k % n == 0) or (k % m == 0)):
#     print('yes')
# else:
#     print('no')