# Task5
# Задача 26:  Напишите программу, которая на вход принимает два числа A и B,
# и возводит число А в целую степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8

# a = int(input('Введите число A: '))
# b = int(input('Введите его степень B: '))
#
# def stepen(a, b):
#     if b == 1:
#         return a
#     else:
#         return (a * stepen(a, b - 1))
#
# print(stepen(a, b))

# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых
# неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.
# *Пример:*
# 2 2
#     4

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
#
# def stepen(a, b):
#     if b == 0:
#         return a
#     else:
#         return (1 + stepen(a, b-1))
#
# print(stepen(a, b))
